list1=[10,20,30,40,50,60,70,80]
print(list1)
#      0  1  2  3  4  5  6  7


#print(list1[list1.index(40):list1.index(70)+1])
#[40, 50, 60, 70]


#print(list1[2:7])
#חותך את הרשימה [70, 60, 50, 40, 30]

#print(list1[:5])
#בלי מספר לפני ה: זה אומר שהוא מתחיל מindex 0 [50, 40, 30, 20, 10]

#print(list1[1:])
#[20, 30, 40, 50, 60, 70, 80]

#print(list1[1:7:2])
#[20, 40, 60]

#print(list1[::2])
#[10, 30, 50, 70]

#print(list1[5::-1])
#[60, 50, 40, 30, 20, 10]

#print(list1[::-1])
#[80, 70, 60, 50, 40, 30, 20, 10]

#print(list1[-2])
#70

#print(list1[-1])
#80

#print(list1[-3::-1])
#[60, 50, 40, 30, 20, 10]

#list1[1:5]=["a","b","c",]
#print(list1)

#list1[1:5]= "a","b","c",
#print(list1)
#[10, 'a', 'b', 'c', 70, 80]